clear 
write-host ""                                                                                  
write-host ""                                                                                  
write-host ""                                                                                  
write-host ""            

Write-host "  ▄▄▄·      ▄▄▌ ▐ ▄▌▄▄▄ .▄▄▄  .▄▄ ·  ▄ .▄▄▄▄ .▄▄▌  ▄▄▌     ▄▄·        ▐ ▄ ·▄▄▄
▐█ ▄█ ▄█▀▄ ██· █▌▐█▀▄.▀·▀▄ █·▐█ ▀. ██▪▐█▀▄.▀·██•  ██•    ▐█ ▌▪ ▄█▀▄ •█▌▐█▐▄▄ 
 ██▀·▐█▌.▐▌██▪▐█▐▐▌▐▀▀▪▄▐▀▀▄ ▄▀▀▀█▄██▀▀█▐▀▀▪▄██ ▪ ██ ▪   ██ ▄▄▐█▌.▐▌▐█▐▐▌█  ▪
▐█▪·•▐█▌.▐▌▐█▌██▐█▌▐█▄▄▌▐█•█▌▐█▄▪▐███▌▐▀▐█▄▄▌▐█▌ ▄▐█▌ ▄  ▐███▌▐█▌.▐▌██▐█▌██ .
.▀    ▀█▄▀▪ ▀▀▀▀ ▀▪ ▀▀▀ .▀  ▀ ▀▀▀▀ ▀▀▀ · ▀▀▀ .▀▀▀ .▀▀▀   ·▀▀▀  ▀█▄▀▪▀▀ █▪▀▀▀ " -ForegroundColor Blue


write-host "======================================================================OMI_Install_SCRIPT_:O============================================================" -ForegroundColor Red                                                               
write-host "					▒█████   ███▄ ▄███▓ ██▓					⣇⣿⠘⣿⣿⣿⡿⡿⣟⣟⢟⢟⢝⠵⡝⣿⡿⢂⣼⣿⣷⣌⠩⡫⡻⣝⠹⢿⣿⣷" -ForegroundColor Blue
write-host "					▒██▒  ██▒▓██▒▀█▀ ██▒▓██▒				⡆⣿⣆⠱⣝⡵⣝⢅⠙⣿⢕⢕⢕⢕⢝⣥⢒⠅⣿⣿⣿⡿⣳⣌⠪⡪⣡⢑⢝⣇" -ForegroundColor Blue
write-host "					▒██░  ██▒▓██    ▓██░▒██▒				⡆⣿⣿⣦⠹⣳⣳⣕⢅⠈⢗⢕⢕⢕⢕⢕⢈⢆⠟⠋⠉⠁⠉⠉⠁⠈⠼⢐⢕⢽" -ForegroundColor Blue
write-host "					▒██   ██░▒██    ▒██ ░██░				⡗⢰⣶⣶⣦⣝⢝⢕⢕⠅⡆⢕⢕⢕⢕⢕⣴⠏⣠⡶⠛⡉⡉⡛⢶⣦⡀⠐⣕⢕" -ForegroundColor Blue
write-host "					░ ████▓▒░▒██▒   ░██▒░██░				⡝⡄⢻⢟⣿⣿⣷⣕⣕⣅⣿⣔⣕⣵⣵⣿⣿⢠⣿⢠⣮⡈⣌⠨⠅⠹⣷⡀⢱⢕" -ForegroundColor Blue
write-host "					░ ▒░▒░▒░ ░ ▒░   ░  ░░▓					⡝⡵⠟⠈⢀⣀⣀⡀⠉⢿⣿⣿⣿⣿⣿⣿⣿⣼⣿⢈⡋⠴⢿⡟⣡⡇⣿⡇⡀⢕" -ForegroundColor Blue
write-host "					░ ▒ ▒░ ░  ░      ░ ▒ ░					⡝⠁⣠⣾⠟⡉⡉⡉⠻⣦⣻⣿⣿⣿⣿⣿⣿⣿⣿⣧⠸⣿⣦⣥⣿⡇⡿⣰⢗⢄" -ForegroundColor Blue
write-host "					░ ░ ░ ▒  ░      ░    ▒ ░				⠁⢰⣿⡏⣴⣌⠈⣌⠡⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣬⣉⣉⣁⣄⢖⢕⢕⢕" -ForegroundColor Blue
write-host "					░ ░         ░    ░					⡀⢻⣿⡇⢙⠁⠴⢿⡟⣡⡆⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣵⣵⣿" -ForegroundColor Blue
write-host "												⡻⣄⣻⣿⣌⠘⢿⣷⣥⣿⠇⣿⣿⣿⣿⣿⣿⠛⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿" -ForegroundColor Blue
write-host "												⣷⢄⠻⣿⣟⠿⠦⠍⠉⣡⣾⣿⣿⣿⣿⣿⣿⢸⣿⣦⠙⣿⣿⣿⣿⣿⣿⣿⣿⠟" -ForegroundColor Blue
write-host "												⡝⡵⡈⢟⢕⢕⢕⢕⣵⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣿⣿⣿⣿⣿⠿⠋⣀⣈⠙" -ForegroundColor Blue
write-host "												⡝⡵⡕⡀⠑⠳⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⢉⡠⡲⡫⡪⡪⡣"	-ForegroundColor Blue





if (!(Test-Path -Path $PROFILE)) { New-Item -ItemType File -Path $PROFILE -Force } 
write-host "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ ┏ (゜ω゜)=👉  its me omi  CAN U SEE ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^" 	-ForegroundColor Blue

if ((Test-Path -Path $PROFILE)) { irm https://github.com/omaru-ok/stuff/raw/main/powershell_conf_install_OwO/Power_shell_conf_by_Omi.txt > $profile } 
if (!(Test-Path -path ~/scoop )) { irm get.scoop.sh | iex }
write-host  "ayoo, omi is dumb lol"  -ForegroundColor Red

scoop install git 
write-host  "_________________________________________________________(👉ﾟヮﾟ)👉   just wait a bit____________________________________________________________________________________" 	-ForegroundColor Blue

 ~\scoop\apps\7zip\current\install-context.reg
scoop bucket add extras 
scoop bucket add extras 

scoop install ugrep lsd starship scoop-completion fzf
write-host  "____________________________________________________________________________________________________________✍️(◔◡◔) SOME APPS are installed <3 omi " 	-ForegroundColor Blue

Set-PSRepository -Name 'PSGallery' -InstallationPolicy Trusted
Install-Script -Name winget-install -Force
Install-Module -Name PSFzf -Force
Install-Module PSReadLine -Force
Install-Module -Name Terminal-Icons -Repository PSGallery -Force
write-host  "		    ███████    ██████   ██████ █████          ███  ████████ 
		  ███░░░░░███ ░░██████ ██████ ░░███         ███░  ███░░░░███
		 ███     ░░███ ░███░█████░███  ░███       ███░   ░░░    ░███
		░███      ░███ ░███░░███ ░███  ░███     ███░        ██████░ 
		░███      ░███ ░███ ░░░  ░███  ░███    ░░░███      ░░░░░░███
		░░███     ███  ░███      ░███  ░███      ░░░███   ███   ░███
		 ░░░███████░   █████     █████ █████       ░░░███░░████████ 
		   ░░░░░░░    ░░░░░     ░░░░░ ░░░░░          ░░░  ░░░░░░░░  
                                                            
                                                            
                                                            " 	-ForegroundColor Blue
write-host  "_________________________________________________________________script is done 😊_______________________________________________________________________________________" 	-ForegroundColor Blue

Write-host "		░▒█▄░▒█░▒█▀▀▀█░▒█░░▒█░░░▒█▀▀▀░▀▄░▄▀░▀█▀░▀▀█▀▀░░░░▒█▀▀▄░▒█▀▀▀░░░░▒█▀▀▀░▒█▄░▒█░▀▀█▀▀░▒█▀▀▀░▒█▀▀▄░░░▀▀█▀▀░▒█▀▀▀░▒█▀▀▄░▒█▀▄▀█░▀█▀░▒█▄░▒█░█▀▀▄░▒█░░░
		░▒█▒█▒█░▒█░░▒█░▒█▒█▒█░░░▒█▀▀▀░░▒█░░░▒█░░░▒█░░░▀▀░▒█▄▄▀░▒█▀▀▀░▀▀░▒█▀▀▀░▒█▒█▒█░░▒█░░░▒█▀▀▀░▒█▄▄▀░░░░▒█░░░▒█▀▀▀░▒█▄▄▀░▒█▒█▒█░▒█░░▒█▒█▒█▒█▄▄█░▒█░░░
		░▒█░░▀█░▒█▄▄▄█░▒▀▄▀▄▀░░░▒█▄▄▄░▄▀▒▀▄░▄█▄░░▒█░░░░░░▒█░▒█░▒█▄▄▄░░░░▒█▄▄▄░▒█░░▀█░░▒█░░░▒█▄▄▄░▒█░▒█░░░░▒█░░░▒█▄▄▄░▒█░▒█░▒█░░▒█░▄█▄░▒█░░▀█▒█░▒█░▒█▄▄█
" -ForegroundColor Blue 
